## 1.Введение
Каждому из нас ежедневно приходится запоминать или записывать список дел на завтра, на неделю, на месяц, которые необходимо вовремя выполнить.
В адресной книге мобильного телефона количество контактов как правило исчисляется десятками и даже сотнями. А для поддерживания отношений хорошим тоном является вовремя поздравить человека с его личным праздником, юбилеем или другой важной датой. Очевидно, что запомнить все даты просто невозможно.
Те, кто привык ценить время и содержать свои персональные данные в порядке, часто используют программу органайзер с напоминалкой, планировщик дел или как электронную записную книжку и базу контактов.
Программа для напоминаний на рабочий стол на русском языке (reminder) - лучшее решение не забыть вовремя поздравить коллег и родственников с праздником, успеть купить подарок, отправить поздравление почтой, погасить задолженность.

## 2. Требования пользователя.
### 2.1.Программные интерфейсы.
Язык программирования: С#.
Среда разработки:VisualStudio.
2.2. Интерфейс пользователя.
Примерный интерфейс:
![Image alt](https://github.com/vladislavtruskov/Birthday_Reminder/blob/master/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA1.PNG)
  ![Image alt](https://github.com/vladislavtruskov/Birthday_Reminder/blob/master/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA2.PNG)
При нажатии кнопки "Add" появляется окно с полями ввода имени и выбора даты дня рождения.
При нажатии кнопки "Remove" в поле всех добавленных друзей и знакомых с их днем рождения,можно удалить ненужное имя.

### 2.3. Характеристики пользователей
Но на этом возможности органайзера не заканчиваются - она позволяет в структурированном виде вести базу клиентов , партнеров, коллег, родственников.
Кажется, что помните все дни рожденья друзей, родственников, знакомых и своего начальства. Но ведь это не так .

## 3. Системные требования
### 3.1. Функциональные требования
1. Создание напоминания
2. Просмотр данных о напоминании 
3. Удаление напоминания
4. Просмотр всех напоминаний
### 3.2. Нефункциональные требования
Возможность создания напоминания в 2 клика. Вожносность использования базы данных напоминаний о днях рождений.
